>Q1. List any five functions of the pandas library with execution.

In [5]:
#function 1

import pandas as pd

# Read data from a CSV file and create a DataFrame object
df = pd.read_csv('Customers.csv')

# Display the first five rows of the DataFrame
df.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [6]:
#function 2
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Profession              1965 non-null   object
 6   Work Experience         2000 non-null   int64
 7   Family Size             2000 non-null   int64
dtypes: int64(6), object(2)
memory usage: 125.1+ KB

In [7]:
#function 3
df.head(2)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3

In [8]:
#function 4
df.tail(2)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [12]:
#function 5
df.describe()

,CustomerID,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,1000.500000,48.960000,110731.821500,50.962500,4.102500,3.768500
std,577.494589,28.429747,45739.536688,27.934661,3.922204,1.970749
min,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,500.750000,25.000000,74572.000000,28.000000,1.000000,2.000000
50%,1000.500000,48.000000,110045.000000,50.000000,3.000000,4.000000
75%,1500.250000,73.000000,149092.750000,75.000000,7.000000,5.000000
max,2000.000000,99.000000,189974.000000,100.000000,17.000000,9.000000

>Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [4]:
import pandas as pd
data=({'A':[1,2,3],
      'B':[4,5,6],
      'C':[7,8,9]})
df=pd.DataFrame(data)

In [5]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [7]:
def reindex(df):
    new_index=pd.RangeIndex(start=1, step=2, stop=len(df)*2+1)
    df = df.reset_index(drop=True).set_index(new_index)
    return df

new_df = reindex(df)

In [9]:
new_df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

>Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [44]:
data=({'values':[10,20,30,40,50]})
df=pd.DataFrame(data)

In [45]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [46]:
def iterate1(df):
    total=0
    for i in range(3):
        total=total+df['values'].iloc[i]
    return 'Sum of the first three values in the "Values" column:', total

In [47]:
type(df)

pandas.core.frame.DataFrame

In [48]:
iterate1(df)

('Sum of the first three values in the "Values" column:', 60)

>Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [54]:
data1=({"text":["hello my name is om sonani",
               "i am a student of master data science course",
               "i am from gujarat"]})
df=pd.DataFrame(data1)

In [55]:
df

                                           text
0                    hello my name is om sonani
1  i am a student of master data science course
2                             i am from gujarat

In [59]:
df['Word_count']=df['text'].apply(lambda x:len(x.split()))

In [60]:
df

                                           text  Word_count
0                    hello my name is om sonani           6
1  i am a student of master data science course           9
2                             i am from gujarat           4

>Q5. How are DataFrame.size() and DataFrame.shape() different?

In [74]:
import pandas as pd
import numpy as np

data = ({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
})
df = pd.DataFrame(data)

In [75]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [82]:
df.size   #DataFrame.size returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and columns

9

In [81]:
df.shape   #DataFrame.shape returns a tuple representing the dimensions of the DataFrame in the form (number of rows, number of columns)

(3, 3)

>Q6. Which function of pandas do we use to read an excel file?

In [85]:
import pandas as pd

df=pd.read_excel('basic.xlsx')

>Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [86]:
data=({'email':['username@domain.com']})
df=pd.DataFrame(data)

In [87]:
df

                 email
0  username@domain.com

In [90]:
df['username']=df['email'].apply(lambda x : x.split('@')[0])

In [91]:
df

                 email  username
0  username@domain.com  username

> Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [92]:
data=({'A':[3,8,6,2,9],
       'B':[5,2,9,3,1],
       'C':[1,7,4,5,2]})
df=pd.DataFrame(data)

In [93]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [97]:
df[(df['A'] > 5) & (df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

>Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [106]:
data=({'values': [1,2,3,40,50,60]})

df=pd.DataFrame(data)

In [107]:
df

   values
0       1
1       2
2       3
3      40
4      50
5      60

In [108]:
df['values'].mean()

26.0

In [109]:
df['values'].median()

21.5

In [110]:
df['values'].std()

27.04810529408668

>Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [114]:
date=pd.date_range(start='2023-04-10',end='2023-04-19')
data={"sales":[100,200,300,400,500,600,700,800,900,1000],
      "Date":date}
df=pd.DataFrame(data)

In [115]:
df

   sales       Date
0    100 2023-04-10
1    200 2023-04-11
2    300 2023-04-12
3    400 2023-04-13
4    500 2023-04-14
5    600 2023-04-15
6    700 2023-04-16
7    800 2023-04-17
8    900 2023-04-18
9   1000 2023-04-19

In [117]:
df['sales'].rolling(window=7,min_periods=1).mean()

0    100.0
1    150.0
2    200.0
3    250.0
4    300.0
5    350.0
6    400.0
7    500.0
8    600.0
9    700.0
Name: sales, dtype: float64

>Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [122]:
import pandas as pd


dates = pd.date_range('2022-01-01', '2022-01-31')
df = pd.DataFrame({'Date': dates})


df['Weekday'] = df['Date'].dt.strftime('%A')

print(df.head(10))

        Date    Weekday
0 2022-01-01   Saturday
1 2022-01-02     Sunday
2 2022-01-03     Monday
3 2022-01-04    Tuesday
4 2022-01-05  Wednesday
5 2022-01-06   Thursday
6 2022-01-07     Friday
7 2022-01-08   Saturday
8 2022-01-09     Sunday
9 2022-01-10     Monday

>Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2022-01-01' and '2022-01-31'.

In [142]:
import pandas as pd

def select_january(df):
    start_date = pd.to_datetime('2022-01-01')
    end_date = pd.to_datetime('2022-01-31')
    return df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

In [143]:
df_january = select_january(df)

In [145]:
df_january

         Date    Weekday
0  2022-01-01   Saturday
1  2022-01-02     Sunday
2  2022-01-03     Monday
3  2022-01-04    Tuesday
4  2022-01-05  Wednesday
5  2022-01-06   Thursday
6  2022-01-07     Friday
7  2022-01-08   Saturday
8  2022-01-09     Sunday
9  2022-01-10     Monday
10 2022-01-11    Tuesday
11 2022-01-12  Wednesday
12 2022-01-13   Thursday
13 2022-01-14     Friday
14 2022-01-15   Saturday
15 2022-01-16     Sunday
16 2022-01-17     Monday
17 2022-01-18    Tuesday
18 2022-01-19  Wednesday
19 2022-01-20   Thursday
20 2022-01-21     Friday
21 2022-01-22   Saturday
22 2022-01-23     Sunday
23 2022-01-24     Monday
24 2022-01-25    Tuesday
25 2022-01-26  Wednesday
26 2022-01-27   Thursday
27 2022-01-28     Friday
28 2022-01-29   Saturday
29 2022-01-30     Sunday
30 2022-01-31     Monday

>Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

*  To use the basic functions of Pandas, the first and foremost necessary library that needs to be imported is pandas itself. The pandas library provides high-performance data manipulation and analysis tools, including functions for creating, reading, updating, and deleting data in a tabular format (like a spreadsheet). It is one of the most widely used Python libraries for data analysis and is often used in conjunction with other libraries like NumPy and Matplotlib.